[{"id":6880,"title":"Gifted Hands The Ben Carson Story","name":"gifted-hands-the-ben-carson-story","showname":"gifted-hands-the-ben-carson-story","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6880/thumb_cvuy284WV0B0t78Ay3GRtto51Vd.jpg","year":2009,"description":"Gifted Hands: The Ben Carson Story is a movie based on the life story of world-renowned neurosurgeon Ben Carson from 1961 to 1987.","type":"movie"},{"id":6879,"title":"Nowhere Special","name":"nowhere-special","showname":"nowhere-special","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6879/thumb_84Fft28dlLSpAHCLKWaGW3V2SHg.jpg","year":2020,"description":"John, a 35-year-old window cleaner, has dedicated his life to bringing up his 4-year-old son, Michael, after the child's mother left them soon after giving birth. When John is given only a few months left to live, he attempts to find a new, perfect family for Michael, determined to shield him from the terrible reality of the situation.","type":"movie"},{"id":6878,"title":"Walk. Ride. Rodeo.","name":"walk-ride-rodeo","showname":"walk-ride-rodeo","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6878/thumb_eUQyvpTtirjQRYi4gVRsVrDvf6T.jpg","year":2019,"description":"Tells the incredible true story of Amberley Snyder, a nationally ranked rodeo barrel racer who defies the odds after barely surviving a car accident that leaves her paralyzed from the waist down.","type":"movie"},{"id":6877,"title":"Celeste & Jesse Forever","name":"celeste-jesse-forever","showname":"celeste-jesse-forever","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6877/thumb_oCMSI1VHn8gqKnhSe9d5dOXxbY8.jpg","year":2012,"description":"Celeste and Jesse met in high school and got married young. They laugh at the same jokes and finish each other’s sentences. They are forever linked in their friends’ minds as the perfect couple – she, a high-powered businesswoman and budding novelist; he, a free spirit who keeps things from getting boring. Their only problem is that they have decided to get divorced. Can their perfect relationship withstand this minor setback?","type":"movie"},{"id":6876,"title":"Arthur and the Invisibles","name":"arthur-and-the-invisibles","showname":"arthur-and-the-invisibles","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6876/thumb_gH27K0S7BiZCsNMxzOQTacG9IZp.jpg","year":2006,"description":"Arthur is a spirited ten-year old whose parents are away looking for work, whose eccentric grandfather has been missing for several years, and who lives with his grandmother in a country house that, in two days, will be repossessed, torn down, and turned into a block of flats unless Arthur's grandfather returns to sign some papers and pay off the family debt. Arthur discovers that the key to success lies in his own descent into the land of the Minimoys, creatures no larger than a tooth, whom his grandfather helped relocate to their garden. Somewhere among them is hidden a pile of rubies, too. Can Arthur be of stout heart and save the day? Romance beckons as well, and a villain lurks.","type":"movie"},{"id":6875,"title":"Lingua Franca","name":"lingua-franca","showname":"lingua-franca","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6875/thumb_20HKDrU2QccbEqzHmPJZRzMPoJM.jpg","year":2020,"description":"Olivia, an undocumented Filipina immigrant paranoid about deportation works as a caregiver to a Russian-Jewish grandmother in Brighton Beach, Brooklyn, NY. When the man she’s secretly paying for a green card marriage backs out, she becomes involved with a slaughterhouse worker who is unaware that she’s a trans woman.","type":"movie"},{"id":6874,"title":"Another Country","name":"another-country","showname":"another-country","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6874/thumb_9wLbEvG9rYfSPnAXLvCz8T0Una2.jpg","year":1984,"description":"In Moscow in 1983, an American journalist interviews Guy Bennett, who recalls his last year at public school, fifty years before, and how it contributed to him becoming a spy.","type":"movie"},{"id":6873,"title":"The Tragedy of Macbeth","name":"the-tragedy-of-macbeth","showname":"the-tragedy-of-macbeth","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6873/thumb_tDNJEhcLbX3jIk3BMCur9pCdaVD.jpg","year":2021,"description":"Macbeth, the Thane of Glamis, receives a prophecy from a trio of witches that one day he will become King of Scotland. Consumed by ambition and spurred to action by his wife, Macbeth murders his king and takes the throne for himself.","type":"movie"},{"id":6872,"title":"Timmy Failure: Mistakes Were Made","name":"timmy-failure-mistakes-were-made","showname":"timmy-failure-mistakes-were-made","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6872/thumb_9Ic99kyJewgPHwl4JftJSwzUmtD.jpg","year":2020,"description":"An 11-year old boy believes that he is the best detective in town and runs the agency Total Failures with his best friend, an imaginary 1,200 pound polar bear.","type":"movie"},{"id":6871,"title":"Zeitgeist: Moving Forward","name":"zeitgeist-moving-forward","showname":"zeitgeist-moving-forward","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6871/thumb_9yZKFyI1z1WMbkCdfL4Z7WIBLqv.jpg","year":2011,"description":"A presentation of a case for a needed transition out of the current socioeconomic monetary paradigm which governs the entire world society. This subject matter will transcend the issues of cultural relativism and traditional ideology and move to relate the core, empirical 'life ground' attributes of human and social survival, extrapolating those immutable natural laws into a new sustainable social paradigm called a 'Resource-Based Economy'.","type":"movie"},{"id":6870,"title":"The Way Back (2020)","name":"the-way-back-2020","showname":"the-way-back-2020","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6870/thumb_ylPnfaphW3FrLBUVwAREVtiL9My.jpg","year":2020,"description":"A former basketball all-star, who has lost his wife and family foundation in a struggle with addiction attempts to regain his soul and salvation by becoming the coach of a disparate ethnically mixed high school basketball team at his alma mater.","type":"movie"},{"id":6869,"title":"Audrey","name":"audrey","showname":"audrey","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6869/thumb_ikAgImz1rkedYM2mW0TeGZP1xdi.jpg","year":2020,"description":"An intimate look at Audrey Hepburn's life, with access to exclusive never-before-seen footage from her family's personal collection, providing an unprecedented and insightful view on Audrey, her life and her dreams, aspirations and her everlasting legacy.","type":"movie"},{"id":6868,"title":"Being the Ricardos","name":"being-the-ricardos","showname":"being-the-ricardos","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6868/thumb_oztBLWdRk5gApYmNdADXvXkLT5m.jpg","year":2021,"description":"Follows Lucille Ball and Desi Arnaz as they face a crisis that could end their careers and another that could end their marriage.","type":"movie"},{"id":6867,"title":"Fear Street 1978","name":"fear-street-1978","showname":"fear-street-1978","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6867/thumb_5dNTxhoGDTHHGqUTdxcr4H1dqlU.jpg","year":2021,"description":"In 1978, two rival groups at Camp Nightwing must band together to solve a terrifying mystery when horrors from their towns' history come alive.","type":"movie"},{"id":6866,"title":"Fear Street 1666","name":"fear-street-1666","showname":"fear-street-1666","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6866/thumb_rmEPtz3Ufzol2VWUAZYzOFaBio3.jpg","year":2021,"description":"In 1666, a colonial town is gripped by a hysterical witch-hunt that has deadly consequences for centuries to come, and it's up to teenagers in 1994 to finally put an end to their town's curse, before it's too late.","type":"movie"},{"id":6865,"title":"Freaky","name":"freaky","showname":"freaky","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6865/thumb_8xC6QSyxrpm0D5A6iyHNemEWBVe.jpg","year":2020,"description":"A mystical, ancient dagger causes a notorious serial killer to magically switch bodies with a 17-year-old girl.","type":"movie"},{"id":6864,"title":"Kipchoge The Last Milestone","name":"kipchoge-the-last-milestone","showname":"kipchoge-the-last-milestone","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6864/thumb_lMYPMCPVlGj2BVkN4nb1aNcQS08.jpg","year":2021,"description":"Kipchoge: The Last Milestone follows record-breaking marathon runner Eliud Kipchoge's journey to becoming the first person in history to run a marathon in under two hours.","type":"movie"},{"id":6863,"title":"Summertime","name":"summertime","showname":"summertime","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6863/thumb_eA3ijMatNICwg6gCGhovcdIBukj.jpg","year":2021,"description":"Over the course of a hot summer day in Los Angeles, the lives of 25 young Angelinos intersect. A skating guitarist, a tagger, two wannabe rappers, an exasperated fast-food worker, a limo driver—they all weave in and out of each other's stories. Through poetry they express life, love, heartache, family, home, and fear. One of them just wants to find someplace that still serves good cheeseburgers.","type":"movie"},{"id":6862,"title":"Black Widow","name":"black-widow","showname":"black-widow","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6862/thumb_qAZ0pzat24kLdO3o8ejmbLxyOac.jpg","year":2021,"description":"Natasha Romanoff, also known as Black Widow, confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.","type":"movie"},{"id":6861,"title":"Stillwater","name":"stillwater","showname":"stillwater","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6861/thumb_cPdmPwcIcmu0ugfKcdFtI3vmOJq.jpg","year":2021,"description":"Bill Baker, an American oil-rig roughneck from Oklahoma, travels to Marseille to visit his estranged daughter, Allison, who is in prison for a murder she claims she did not commit. Confronted with language barriers, cultural differences, and a complicated legal system, Bill builds a new life for himself in France as he makes it his personal mission to exonerate his daughter.","type":"movie"},{"id":6860,"title":"She Dies Tomorrow","name":"she-dies-tomorrow","showname":"she-dies-tomorrow","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6860/thumb_zzFftAIaCkNDt8TL4yQN8RweLrw.jpg","year":2020,"description":"Amy is ravaged by the notion that she is going to die tomorrow, which sends her down a dizzying emotional spiral. When her skeptical friend Jane discovers Amy’s feeling of imminent death to be contagious, they both begin bizarre journeys through what might be the last day of their lives.","type":"movie"},{"id":6859,"title":"The Canyon","name":"the-canyon","showname":"the-canyon","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6859/thumb_d4fyho9nANayruMLY2rzWLPaLMN.jpg","year":2009,"description":"A survival story about a honeymooning couple who get lost in the wide expanse of the Grand Canyon.","type":"movie"},{"id":6858,"title":"An Unexpected Christmas","name":"an-unexpected-christmas","showname":"an-unexpected-christmas","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6858/thumb_nnDDE8btTfi6PKDTzJ2CMChDwpu.jpg","year":2021,"description":"Jamie hasn’t told his family that he and his now ex-girlfriend Emily broke up. After an inopportune run-in with Emily at the train station in his hometown, Jamie convinces her to pretend they’re still a couple to avoid ruining Christmas for his family.","type":"movie"},{"id":6857,"title":"Harry Potter 20th Anniversary: Return to Hogwarts","name":"harry-potter-20th-anniversary-return-to-hogwarts","showname":"harry-potter-20th-anniversary-return-to-hogwarts","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6857/thumb_cBc8kP23xdEW64htQGhCqBtZdkE.jpg","year":2022,"description":"An enchanting making-of story told through all-new in-depth interviews and cast conversations, inviting fans on a magical first-person journey through one of the most beloved film franchises of all time.","type":"movie"},{"id":6856,"title":"The Boss Baby: Family Business","name":"the-boss-baby-family-business","showname":"the-boss-baby-family-business","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6856/thumb_kv2Qk9MKFFQo4WQPaYta599HkJP.jpg","year":2021,"description":"The Templeton brothers — Tim and his Boss Baby little bro Ted — have become adults and drifted away from each other. But a new boss baby with a cutting-edge approach and a can-do attitude is about to bring them together again … and inspire a new family business.","type":"movie"},{"id":6855,"title":"Christmas in Tune","name":"christmas-in-tune","showname":"christmas-in-tune","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6855/thumb_3Zkov4V8mYyC12l7m8SE3kXR1K2.jpg","year":2021,"description":"Years after their personal and professional breakup, the singing duo of Georgia and Joe Winter agree to reunite after their daughter, Belle, asks them to participate in a Christmas Charity concert, only to find themselves getting back in tune on stage and off.","type":"movie"},{"id":6854,"title":"Mother/Android","name":"mother-android","showname":"mother-android","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6854/thumb_rO3nV9d1wzHEWsC7xgwxotjZQpM.jpg","year":2021,"description":"Georgia and her boyfriend Sam go on a treacherous journey to escape their country, which is caught in an unexpected war with artificial intelligence. Days away from the arrival of their first child, the couple must face No Man’s Land—a stronghold of the android uprising—in hopes of reaching safety before giving birth.","type":"movie"},{"id":6853,"title":"Last Train to Christmas","name":"last-train-to-christmas","showname":"last-train-to-christmas","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6853/thumb_xkVUORoeRbRnAq5IkN4Pwq45R07.jpg","year":2021,"description":"When successful 80s nightclub manager Tony Towers boards a magical train at Christmas, he discovers that each carriage harbours a different stage of his life and the actions he takes in one carriage directly affect his life in the next. Can Tony change his life – and the lives of the people he loves – for the better, or will he just make things worse?","type":"movie"},{"id":6852,"title":"Don't Look Up","name":"don-t-look-up","showname":"don-t-look-up","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6852/thumb_5SkzM3TPpt72FoO46NSjipNXkNG.jpg","year":2021,"description":"Two low-level astronomers must go on a giant media tour to warn mankind of an approaching comet that will destroy planet Earth.","type":"movie"},{"id":6851,"title":"Happier Than Ever: A Love Letter to Los Angeles","name":"happier-than-ever-a-love-letter-to-los-angeles","showname":"happier-than-ever-a-love-letter-to-los-angeles","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6851/thumb_i4Udcw6o4ASxd1Q5E0SWXnMtPNm.jpg","year":2021,"description":"Fresh off the heels of her brand-new album, \"Happier Than Ever,\" this cinematic concert experience features an intimate performance of every song in the album's sequential order – for the first and only time – from the stage of the legendary Hollywood Bowl.","type":"movie"},{"id":6850,"title":"Superstar","name":"superstar","showname":"superstar","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6850/thumb_7fGxrk34JC0du5jtIMv06U0L67W.jpg","year":1999,"description":"Orphan Mary Katherine Gallagher, an ugly duckling at St. Monica High School, has a dream: to be kissed soulfully. She decides she can realize this dream if she becomes a superstar, so her prayers, her fantasies, and her conversations with her only friend focus on achieving super-stardom.","type":"movie"},{"id":6849,"title":"Christmas Oranges","name":"christmas-oranges","showname":"christmas-oranges","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6849/thumb_rvjtIyPABUZ72znleY52zDCuPvN.jpg","year":2012,"description":"In a town not so far away and a time not so long ago, baby Rose was left on the porch of Greenwoods Orphanage, where Mrs. Hartley and the children under her tender care become her family. But when tragedy strikes, Rose loses the only home she has ever known and she is abruptly shipped to Irongates—a place that seems as cold and cruel as her previous home was kind. Strict headmaster Mr. Crampton immediately seems to dislike Rose and makes sure she and the other children are punished for any minor infraction of his rules. Rose soon makes friends with Emily, but in spite of her gentle and forgiving nature, some of the children will take any chance they can to get her into trouble. When she learns that every Christmas Mr. Crampton’s generous brother gives an orange to each child, Rose waits in eager anticipation.","type":"movie"},{"id":6848,"title":"The Bitch Who Stole Christmas","name":"the-bitch-who-stole-christmas","showname":"the-bitch-who-stole-christmas","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6848/thumb_ZJDUNqh4zdU71w1UYFf46S4vXp.jpg","year":2021,"description":"A workaholic big-city fashion journalist is sent to a Christmas-obsessed small town to dig up a story when she finds herself in the middle of cut-throat housewives, a high-stakes “Winter Ball” competition, and a sinister plot that could destroy Christmas fore-evah!","type":"movie"},{"id":6847,"title":"Bad Trip","name":"bad-trip","showname":"bad-trip","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6847/thumb_A1Gy5HX3DKGaNW1Ay30NTIVJqJ6.jpg","year":2020,"description":"Two pals embark on a road trip full of funny pranks that pull real people into mayhem.","type":"movie"},{"id":6846,"title":"Mixed Nuts","name":"mixed-nuts","showname":"mixed-nuts","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6846/thumb_rI5oZR0ov3ki72Gy1QDM8XJ43mo.jpg","year":1994,"description":"The events of a crisis hotline business on one crazy night during the Christmas holidays.","type":"movie"},{"id":6845,"title":"Birdy","name":"birdy","showname":"birdy","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6845/thumb_29pXKXcPANhOTxyFqTGEaw7nIws.jpg","year":1984,"description":"Two young men are seriously affected by the Vietnam war. One of them has always been obsessed with birds - but now believes he really is a bird, and has been sent to a mental hospital. Can his friend help him pull through?","type":"movie"},{"id":6844,"title":"The Unforgivable","name":"the-unforgivable","showname":"the-unforgivable","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6844/thumb_gPQM1zqqsm6Lw1tHF41BwbmOkya.jpg","year":2021,"description":"A woman is released from prison after serving a sentence for a violent crime and re-enters a society that refuses to forgive her past.","type":"movie"},{"id":6843,"title":"The Parallax View","name":"the-parallax-view","showname":"the-parallax-view","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6843/thumb_6Ef0w6xcBbRUiKQkSSECw7xjsg3.jpg","year":1974,"description":"An ambitious reporter, investigating a senator's assassination, realizes witnesses to the shooting are systematically dying and discovers a multi-million dollar corporation which serves as a front for the recruitment of political assassins.","type":"movie"},{"id":6842,"title":"The Grifters","name":"the-grifters","showname":"the-grifters","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6842/thumb_zMpGfkiDIdg5bB7WGcAT3Fdrfpt.jpg","year":1990,"description":"A young short-con grifter suffers both injury and the displeasure of reuniting with his criminal mother, all the while dating an unpredictable young lady.","type":"movie"},{"id":6841,"title":"Holiday Rush","name":"holiday-rush","showname":"holiday-rush","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6841/thumb_ccL8XtMJSAl5VRoOdyKn7Cd0QA2.jpg","year":2019,"description":"After his sudden firing, a popular radio DJ moves in with his aunt, bringing along his four spoiled children, and a plan to return to the airwaves.","type":"movie"},{"id":6840,"title":"The Kid Detective","name":"the-kid-detective","showname":"the-kid-detective","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6840/thumb_2WrT8AZUcDicvf5m8KVgspQEHK3.jpg","year":2020,"description":"A once-celebrated kid detective, now 31, continues to solve the same trivial mysteries between hangovers and bouts of self-pity. Until a naive client brings him his first 'adult' case, to find out who brutally murdered her boyfriend.","type":"movie"},{"id":6839,"title":"A Kiss Before Christmas","name":"a-kiss-before-christmas","showname":"a-kiss-before-christmas","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6839/thumb_ma8NZSDDx7e7BnYS9Rca3oDknOd.jpg","year":2021,"description":"Ethan, always the nice guy, wakes up in a new reality at Christmas. Initially, he is enthralled with his new life but soon realizes that it's not what he thought it would be.","type":"movie"},{"id":6838,"title":"Werewolves Within","name":"werewolves-within","showname":"werewolves-within","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6838/thumb_WoG2tvwanOMlU0qsbxpf9Qd3y.jpg","year":2021,"description":"When a proposed pipeline creates hostilities between residents of a small town, a newly-arrived forest ranger must keep the peace after a snowstorm confines the townspeople to an old lodge. But when a mysterious creature begins terrorizing the group, their worst tendencies and prejudices rise to the surface, and it is up to the ranger to keep the residents alive, both from each other and the monster which plagues them.","type":"movie"},{"id":6837,"title":"Things To Do In Denver When You're Dead","name":"things-to-do-in-denver-when-you-re-dead","showname":"things-to-do-in-denver-when-you-re-dead","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6837/thumb_oPp6Gbrasox66WyMvPS0k8OakQf.jpg","year":1995,"description":"Five different criminals face imminent death after botching a job quite badly.","type":"movie"},{"id":6836,"title":"Holiday in Santa Fe","name":"holiday-in-santa-fe","showname":"holiday-in-santa-fe","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6836/thumb_uHkMQtYNIRPAN3SaGxTd7lLKr35.jpg","year":2021,"description":"Sparks fly when a greeting card executive arrives in Santa Fe to acquire a tight-knit family company that creates ornaments inspired by Mexican Christmas traditions.","type":"movie"},{"id":6835,"title":"Finding You","name":"finding-you","showname":"finding-you","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6835/thumb_mRSsYtYcbhNAfHBp3ha1Nr65agi.jpg","year":2021,"description":"Finley, a talented aspiring violinist, meets Beckett, a famous young movie star, on the way to her college semester abroad program in a small coastal village in Ireland. An unexpected romance emerges as the heartthrob Beckett leads the uptight Finley on an adventurous reawakening, and she emboldens him to take charge of his future, until the pressures of his stardom get in the way.","type":"movie"},{"id":6834,"title":"The Princess Switch 3: Romancing the Star","name":"the-princess-switch-3-romancing-the-star","showname":"the-princess-switch-3-romancing-the-star","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6834/thumb_i4r6PuRqRdy46chzEMftrgrQQ7D.jpg","year":2021,"description":"When a priceless relic is stolen, Queen Margaret and Princess Stacy enlist the help of Margaret’s audacious look-alike cousin Fiona again who teams with a dashing, mysterious man from her past to retrieve it, rekindling the sparks of a tantalizing Christmas romance and resulting in a very unexpected switch.","type":"movie"},{"id":6833,"title":"No Man of God","name":"no-man-of-god","showname":"no-man-of-god","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6833/thumb_jJzmSlNorOu6yvHSjXoF0bBcx17.jpg","year":2021,"description":"The complicated relationship that formed between the FBI analyst Bill Hagmaier and serial killer Bundy during Bundy's final years on death row.","type":"movie"},{"id":6832,"title":"In the Heights","name":"in-the-heights","showname":"in-the-heights","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6832/thumb_RO4KoJyoQMQzh9z76d4v4FJMmJ.jpg","year":2021,"description":"The story of Usnavi, a bodega owner who has mixed feelings about closing his store and retiring to the Dominican Republic or staying in Washington Heights.","type":"movie"},{"id":6831,"title":"Anna and the Apocalypse","name":"anna-and-the-apocalypse","showname":"anna-and-the-apocalypse","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6831/thumb_jVyqqMzDVRjUMeIoaJKSUpRnB9Y.jpg","year":2018,"description":"A zombie apocalypse threatens the sleepy town of Little Haven – at Christmas – forcing Anna and her friends to fight, slash and sing their way to survival, facing the undead in a desperate race to reach their loved ones. But they soon discover that no one is safe in this new world, and with civilization falling apart around them, the only people they can truly rely on are each other.","type":"movie"},{"id":6830,"title":"Annie Live!","name":"annie-live","showname":"annie-live","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6830/thumb_sVvCYvChT69s1r1kF3jOT0HCCM0.jpg","year":2021,"description":"A young orphan opens the heart of billionaire Sir Oliver \"Daddy\" Warbucks.","type":"movie"},{"id":6828,"title":"Adele One Night Only","name":"adele-one-night-only","showname":"adele-one-night-only","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6828/thumb_A7tO3IHm02FqRvE4R78bDkYX1Al.jpg","year":2021,"description":"A primetime special with performances from the superstar including Adele’s first new material in six years plus her chart-topping hits. The special will also feature an exclusive interview with Adele by Oprah Winfrey from her rose garden, in Adele’s first televised wide-ranging conversation.","type":"movie"},{"id":6826,"title":"Robin Robin","name":"robin-robin","showname":"robin-robin","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6826/thumb_Robin_Robin_poster.png","year":2021,"description":"In this stop-motion short film, a bird raised by mice begins to question where she belongs and sets off on a daring journey of self-discovery.","type":"movie"},{"id":6825,"title":"The Lego Star Wars Holiday Special","name":"the-lego-star-wars-holiday-special","showname":"the-lego-star-wars-holiday-special","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6825/thumb_zyzJSI7UZZzz5Toj10rYGF5689z.jpg","year":2020,"description":"As her friends prep for a Life Day holiday celebration, Rey journeys with BB-8 on a quest to gain a deeper knowledge of the Force at a mysterious Jedi Temple. There, she embarks on a cross-timeline adventure through beloved moments in Star Wars history, coming into contact with iconic heroes and villains from all eras of the saga. But will she make it back in time for the Life Day feast?","type":"movie"},{"id":6824,"title":"Red Notice","name":"red-notice","showname":"red-notice","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6824/thumb_wdE6ewaKZHr62bLqCn7A2DiGShm.jpg","year":2021,"description":"An Interpol-issued Red Notice is a global alert to hunt and capture the world's most wanted. But when a daring heist brings together the FBI's top profiler and two rival criminals, there's no telling what will happen.","type":"movie"},{"id":6823,"title":"Single All the Way","name":"single-all-the-way","showname":"single-all-the-way","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6823/thumb_bfZPNzAwUQZ6FZQi1d136KLr3wl.jpg","year":2021,"description":"Desperate to avoid his family’s judgment about his perpetual single status, Peter convinces his best friend Nick to join him for the holidays and pretend that they’re now in a relationship. But when Peter’s mother sets him up on a blind date with her handsome trainer James, the plan goes awry.","type":"movie"},{"id":6822,"title":"Womb","name":"womb","showname":"womb","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6822/thumb_w98sx8jPYWeRZORdmgkmDMcBFuH.jpg","year":2010,"description":"A woman's consuming love forces her to bear the clone of her dead beloved. From his infancy to manhood, she faces the unavoidable complexities of her controversial decision.","type":"movie"},{"id":6821,"title":"Bruised","name":"bruised","showname":"bruised","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6821/thumb_axibOQF9QnThrr8M37ufAYurP4R.jpg","year":2021,"description":"Jackie Justice is a mixed martial arts fighter who leaves the sport in disgrace. Down on her luck and simmering with rage and regret years after the fight, she's coaxed into a brutal underground fight by her manager and boyfriend Desi and grabs the attention of a fight league promoter who promises Jackie a life back in the Octagon. But the road to redemption becomes unexpectedly personal when Manny - the son she gave up as an infant - shows up at her doorstep. A triumphant story of a fighter who reclaims her power, in and out of the ring, when everyone has counted her out","type":"movie"},{"id":6820,"title":"A Boy Called Christmas","name":"a-boy-called-christmas","showname":"a-boy-called-christmas","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6820/thumb_1sRejtiHOZGggZd9RcmdqbapLM5.jpg","year":2021,"description":"An ordinary young boy called Nikolas sets out on an extraordinary adventure into the snowy north in search of his father who is on a quest to discover the fabled village of the elves, Elfhelm. Taking with him a headstrong reindeer called Blitzen and a loyal pet mouse, Nikolas soon meets his destiny in this magical and endearing story that proves nothing is impossible…","type":"movie"},{"id":6819,"title":"Untold: Breaking Point","name":"untold-breaking-point","showname":"untold-breaking-point","image":"https://uploads.ororo-mirror.tv/uploads/movie/poster/6819/thumb_cOiIkZK6ZjAqU3PFFeUFAvNhup5.jpg","year":2021,"description":"Under pressure to continue a winning tradition in American tennis, Mardy Fish faced mental health challenges that changed his life on and off the court.","type":"movie"}]